#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.instance_service_account.google_service_account.service_accounts["custom-instance-sa"]: Refreshing state... [id=projects/scalesec-dev/serviceAccounts/custom-instance-sa@scalesec-dev.iam.gserviceaccount.com]
module.service_accounts.google_service_account.service_accounts["chef-inspec-sa"]: Refreshing state... [id=projects/tdd-testing-environment/serviceAccounts/chef-inspec-sa@tdd-testing-environment.iam.gserviceaccount.com]
module.service_accounts.data.template_file.keys["chef-inspec-sa"]: Refreshing state... [id=e3b0c44298fc1c149afbf4c8996fb92427ae41e4649b934ca495991b7852b855]
module.instance_service_account.data.template_file.keys["custom-instance-sa"]: Refreshing state... [id=e3b0c44298fc1c149afbf4c8996fb92427ae41e4649b934ca495991b7852b855]
module.service_accounts.google_project_iam_member.project-roles["chef-inspec-sa-tdd-testing-environment=>roles/viewer"]: Refreshing state... [id=tdd-testing-environment/roles/viewer/serviceaccount:chef-inspec-sa@tdd-testing-environment.iam.gserviceaccount.com]
google_compute_instance.scalesec: Refreshing state... [id=projects/scalesec-dev/zones/us-west1-a/instances/scalesec-test]
module.instance_service_account.google_project_iam_member.project-roles["custom-instance-sa-scalesec-dev=>roles/secretmanager.secretAccessor"]: Refreshing state... [id=scalesec-dev/roles/secretmanager.secretAccessor/serviceaccount:custom-instance-sa@scalesec-dev.iam.gserviceaccount.com]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_firewall.ssh will be created
  + resource "google_compute_firewall" "ssh" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "allow-ssh"
      + network            = "default"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]

      + allow {
          + ports    = [
              + "22",
            ]
          + protocol = "tcp"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @eric-gonzales, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*